app/controllers/backend_controller.rb

INSERT INTO `merchants` (`created_at`, `updated_at`, `title`, `url`, `thumbnail`, `hashtag`, `explain`, `rating`) VALUES ('2017-03-22 07:20:57', '2017-03-22 07:20:57', '1250도씨', 'http://www.1250.co.kr/', 'http://', '도자기, 접시,핸드메이드, 한식 , 내츄럴, ', '', 1)
---
	def db_input
		input = params[:input_textarea]

		table = input.split("\r\n")
		table.each do |line|
			i = 0
      whole_att = line.split("\t")
			if params[:table]=="merchant"
        record = Merchant.where("title=?",whole_att[2]).first_or_create

SELECT  `merchants`.* FROM `merchants` WHERE `merchants`.`id` = 36 LIMIT 1
DELETE FROM `merchants` WHERE `merchants`.`id` = 36
---
	def db_delete
		input = params[:id]
		record = Merchant.find(input.to_i)
		record.destroy