app/controllers/front_controller.rb

	def index
		@head_tag = ["모던한","북유럽","폴란드","핸드메이드","일본식","귀여운","클래식","한식"]
		@merchant= Merchant.all
---
SELECT `merchants`.* FROM `merchants`

	def bridge

		input = params[:id]
		@record = Merchant.find(input.to_i)
---
SELECT  `merchants`.* FROM `merchants` WHERE `merchants`.`id` = 290 LIMIT 1

	def db_admin
		@merchants = Merchant.all
---
SELECT `merchants`.* FROM `merchants`